# WitnsLineTickMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WitnsLineTickMark Property
ParameterTypeId Class See Also
---
"Witness Line Tick Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WitnsLineTickMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WitnsLineTickMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WitnsLineTickMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace